app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "price", "cuisine", "location", "photo") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mcdonalds"], ["price", "Cheap"], ["cuisine", "American"], ["location", "Wetherill Park"], ["photo", "fillmurray.com/300/300"]]
---
  def create
    Restaurant.create restaurant_params

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find params[:id]

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @restaurant = Restaurant.find params[:id]

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "restaurants" SET "price" = $1 WHERE "restaurants"."id" = $2  [["price", "Expensive"], ["id", 6]]
---
  def update
    restaurant = Restaurant.find params[:id]
    restaurant.update restaurant_params

DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]
---
def destroy
  Restaurant.destroy params[:id]