app/controllers/reviews_controller.rb

  def new
    @review = Review.new
    @restaurant = Restaurant.find params[:id]
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1282], ["LIMIT", 1]]

  def create
  @current_user.reviews.create review_params
---
INSERT INTO "reviews" ("created_at", "updated_at", "rating", "comment", "user_id", "restaurant") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2020-01-16 12:50:57.390400"], ["updated_at", "2020-01-16 12:50:57.390400"], ["rating", 23], ["comment", "Amazing"], ["user_id", 39], ["restaurant", "Amazing Restaurant"]]